# Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.

import defs

num_1 = int(input("Введите число: "))
num_2 = int(input("Введите степень числа(целое неотрицательно число) "))

print(defs.umnojenie_nums(num_1, num_2))