# Напишите функцию pos_add(a, b), которая возвращает 
# положительное значение сложения двух целых чисел.

def pos_add(a, b):
    return abs(a + b)

print(pos_add(10, -15)) # 5