# Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)

from def6 import *

print(min_max_in_nums(create_int_array(int(input("Введите длину массива: ")))))